name: "ensemble"
platform: "ensemble"
max_batch_size: ${triton_max_batch_size}
input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "pooling_mode"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  },
  {
    name: "normalize_final_emb"
    data_type: TYPE_BOOL
    dims: [ 1 ]
    optional: true
  }
]
output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessing"
      model_version: -1
      input_map {
        key: "QUERY"
        value: "text_input"
      }
      output_map {
        key: "INPUT_ID"
        value: "_INPUT_ID"
      }
      output_map {
        key: "TOKEN_TYPE_IDS"
        value: "_TOKEN_TYPE_IDS"
      }
      output_map {
        key: "ATTENTION_MASK"
        value: "_ATTENTION_MASK"
      }
    },
    {
      model_name: "model"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "_INPUT_ID"
      }
      input_map {
        key: "token_type_ids"
        value: "_TOKEN_TYPE_IDS"
      }
      input_map {
        key: "attention_mask"
        value: "_ATTENTION_MASK"
      }
      output_map {
        key: "last_hidden_state"
        value: "_LAST_HIDDEN_STATE"
      }
    },
    {
      model_name: "postprocessing"
      model_version: -1
      input_map {
        key: "INPUT_EMBEDDINGS"
        value: "_LAST_HIDDEN_STATE"
      }
      input_map {
        key: "ATTENTION_MASKS"
        value: "_ATTENTION_MASK"
      }
      input_map {
        key: "CUSTOM_POOLING_MODE"
        value: "pooling_mode"
      }
      input_map {
        key: "NORMALIZE_FINAL_EMB"
        value: "normalize_final_emb"
      }
      output_map {
        key: "OUTPUT"
        value: "embeddings"
      }
    }
  ]
}
